alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Layout (KB hidden) ---
#define HIST_H_KB_HIDE  220
#define IBAR_Y_KB_HIDE  220
#define IBAR_H_KB_HIDE   20
#ifdef TARGET_C3
#undef  HIST_H_KB_HIDE
#define HIST_H_KB_HIDE  SCREEN_H   // C3: no separate input bar — full screen is chat + input line
#endif

// --- Colours ---
#define COL_BG          0x0841   // #080808 — nearest RGB565 to #0D0D0D
#define COL_USER        TFT_CYAN
#define COL_USER_LIGHT  0x8400   // dark yellow / olive — user text in Light Theme
#define COL_AI          0xF760   // #F8EC00 — nearest RGB565 to #FFEE00
#define COL_ERROR       TFT_RED
#define COL_KEY_FACE    0x4208   // dark grey
#define COL_KEY_LABEL   TFT_WHITE
#define COL_IBAR_BG     0x2104   // very dark grey
#define COL_IBAR_TEXT   TFT_WHITE
#define COL_BTN_BG      0x2945   // mid grey
#define COL_BTN_TEXT    TFT_WHITE

// --- UI text metrics: must match uiFontOn() ---
#ifdef TARGET_C3
#define TXT_W   FONT_TXT_W   // font average char width (proportional)
#define TXT_H   FONT_TXT_H   // font line height (matches LINE_H_LARGE)
#else
#define TXT_W  6    // GLCD size-1: 6px char width
#define TXT_H  8    // GLCD size-1: 8px char height
#endif

// --- Objects ---
#ifdef TARGET_EPAPER
EpaperDisplay tft;
#  define TFT_eSprite EpaperSprite   // redirects all TFT_eSprite spr(&tft) to the stub
#else
TFT_eSPI tft = TFT_eSPI();
#endif

#ifdef TARGET_EPAPER
// Set true by addMessage() or scroll handlers to bypass the EPD_MIN_FULL_REFRESH_MS rate limit.
static bool epdMsgPending       = false;
static bool epdPromptInInputRow = false;  // short user prompt: replace input row, no scroll
static char epdPromptBuf[128]   = "";
static bool epdShowModel        = false;  // show model name until first AI response
static bool epdSleeping         = false;  // replace input row with sleep message
#endif

// --- Keyboard layout ---
#ifdef TARGET_C3
constexpr bool kbVisible = false;
#else
bool kbVisible = true;
#endif
bool shiftOn   = false;   // starts lowercase
bool altOn     = false;   // alt layer off by default

const char* KB_ROW1          = "QWERTYUIOP";
const char* KB_ROW2          = "ASDFGHJKL";
const char* KB_ROW3          = "ZXCVBNM";
const char* KB_NUM_UNSHIFTED = "1234567890";
const char* KB_NUM_SHIFTED   = "!@#$%^&*()";

// Alt layer for number row
const char* KB_NUM_ALT_TYPED[10] = { "|", "\"", ":", "{", "}", "'", "@", "-", "+", "=" };
const char* KB_NUM_ALT_DISP[10]  = { "|", "\"", ":", "{", "}", "'", "@", "-", "+", "=" };

#define KEY_W       32
#define KEY_H       20
#define KEY_GAP      1
#define KB_ROW1_X    0   // all rows flush left — 10 × 32 = 320px
#define KB_ROW2_X    0
#define KB_ROW3_X    0

// Row 4 special key widths and positions
// [Shift 40]+[Alt 40]+[Space 166]+[Hide 42] + tall BS (26×45) at bottom-right
// Hide RHS=288 aligns with '.' key RHS; BS starts at 294 (gap of 6px after Hide)
#define BS_W        26   // ~20% thinner than KEY_W=32
#define BS_X       294   // bottom right (SCREEN_W - BS_W)
#define BS_H        40   // tall delete key; drawn from (SCREEN_H - BS_H) upward
#define SHIFT_W     40
#define SHIFT_X      0
#define ALT_W       40
#define ALT_X       40   // SHIFT_X + SHIFT_W
#define SPACE_W    166   // HIDE_X(246) - SPACE_X(80)
#define SPACE_X     80   // ALT_X + ALT_W
#define HIDE_W      42
#define HIDE_X     246   // SPACE_X + SPACE_W; RHS=288 = '.' key RHS

// --- Key appearance ---
#define KEY_RADIUS        3     // rounded corner radius for keys
#define KEY_INSET         1     // inset drawn box by this many px each side (~10% smaller)

// --- Layout metrics ---
#define LINE_H_LARGE     FONT_LINE_H          // VLW font yAdvance (set in font.h)
#define LINE_H_SMALL     12                   // DejaVuSansBold10px line height
#define SPLASH_H         (3 * LINE_H_LARGE)   // boot splash: 3 lines tall
#ifdef TARGET_P3
#  define LINE_H_P3 12   // P3 284×76: tighter than yAdvance=15, gives 6 lines
#else
#  define LINE_H_P3 LINE_H_LARGE
#endif

// --- Input bar ---
#define INPUT_BUF_SIZE  256     // input text buffer including null terminator
#define INPUT_MAX_LEN   255     // max typeable characters (INPUT_BUF_SIZE - 1)
#define BTN_SEND_W       46     // width of Send/More button
#define BTN_SEND_X_TEXT  39     // distance of Send/More text from right edge
#define BTN_SHOWKB_W     58     // width of Show KB button
#define BTN_SHOWKB_X    144     // distance of Show KB button left edge from right (BTN_NEW_X + BTN_SHOWKB_W + 2)
#define BTN_NEW_W        36     // width of New button (KB hidden only)
#define BTN_NEW_X        84     // distance of New button left edge from right (BTN_SEND_W + BTN_NEW_W + 2)
#define BTN_INSET         2     // pixel inset for button fill within input bar

// --- Timing ---
#define WIFI_MAX_ATTEMPTS    30    // max retries waiting for WiFi (× WIFI_RETRY_DELAY_MS)
#define WIFI_RETRY_DELAY_MS 500    // ms between WiFi connect retries
#define KEY_FLASH_MS        100    // key highlight flash duration on tap
#define API_TIMEOUT_MS    25000    // API response deadline ms
#define API_WAIT_FIRST_MS  4000    // ms before first waiting message appears

#define WIFI_IDLE_TIMEOUT_MS    60000    // 60 seconds
#define DEEP_SLEEP_TIMEOUT_MS  300000    //5 mins → deep sleep (TARGET_EPAPER only)
unsigned long lastActivityMs = 0;      // Tracks the last time the user pressed a key

// --- WiFi RSSI thresholds for LED colour ---
#define RSSI_THRESH_BLUE   -55    // ≥ this dBm → blue (strongest)
#define RSSI_THRESH_CYAN   -65    // ≥ this dBm → cyan (good)
#define RSSI_THRESH_GREEN  -75    // ≥ this dBm → green (fair)

// --- API ---
#define HTTPS_PORT        443
#define GEMINI_HOST       "generativelanguage.googleapis.com"
#define GROK_HOST         "eu-west-1.api.x.ai"
#define GROK_MODEL        "grok-4-1-fast-reasoning"
#define GROQ_HOST         "api.groq.com"
#define GROQ_MODEL        "openai/gpt-oss-120b"

// --- AI system prompt ---
// Word limit varies by display size: e-paper (200×200) fits fewer lines than TFT (320×240).
#ifdef TARGET_EPAPER
#  define AI_MAX_WORDS_STR "80"
#else
#  define AI_MAX_WORDS_STR "120"
#endif
#define AI_SYSTEM_PROMPT \
    "Respond in " AI_MAX_WORDS_STR " words or fewer. Plain text only: no markdown, " \
    "no ** or * emphasis, no tables, no bullet symbols, no numbered or unnumbered lists. " \
    "Use paragraphs to separate distinct ideas. Never include URLs, hyperlinks, citations, " \
    "footnotes, source references, or attribution of any kind. Do not mention where " \
    "information came from unless asked."
// Appended for models with a web search tool (Gemini, Grok — not Groq).
#define AI_WEB_SEARCH_SUFFIX \
    " When quoting current or time-sensitive information, use your web search tool to check live sources first."

