alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// fontOn() loads the selected smooth font (see font.h). fontOff() unloads and restores GLCD.
void fontOn()  { FONT_LOAD(tft); }
void fontOff() { FONT_UNLOAD(tft); tft.setTextFont(1); }  // always restore GLCD explicitly

// UI text helpers: C3 uses smooth font everywhere. CYD28 uses GLCD size 1 (6×8px).
#ifdef TARGET_C3
inline void uiFontOn()  { fontOn(); }
inline void uiFontOff() { fontOff(); }
#else
inline void uiFontOn()  { tft.setTextSize(1); }
inline void uiFontOff() {}
#endif

void drawKey(int x, int y, int w, int h, const char* label, uint16_t face, uint16_t text) {
    tft.fillRect(x, y, w, h, COL_BG);  // clear cell; COL_BG shows as border around inset box
    tft.fillRoundRect(x + KEY_INSET, y + KEY_INSET, w - 1 - 2*KEY_INSET, h - 2*KEY_INSET, KEY_RADIUS, face);
    tft.setTextColor(text, face);
    fontOn();
    int tx = x + (w - (int)tft.textWidth(label)) / 2;
    int ty = y + (h - 15) / 2 + 1;   // 15 = yAdvance; +1 lowers text slightly
    tft.drawString(label, tx, ty);
    fontOff();           // restore GLCD for everything else
}

#ifndef TARGET_C3
void drawKeyboard() {
    if (!kbVisible) return;
    tft.fillRect(0, KB_Y, SCREEN_W, KB_H, COL_BG);
    int rowStep = KEY_H + KEY_GAP;
    int x;

    // Row 0: number / symbol / alt keys
    x = 0;
    for (int i = 0; i < 10; i++) {
        if (altOn) {
            drawKey(x, KB_Y, KEY_W, KEY_H, KB_NUM_ALT_DISP[i], COL_KEY_FACE, COL_KEY_LABEL);
        } else {
            char label[2] = { shiftOn ? KB_NUM_SHIFTED[i] : KB_NUM_UNSHIFTED[i], 0 };
            drawKey(x, KB_Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        }
        x += KEY_W;
    }

    // Row 1: QWERTY (centred, no Hide button)
    x = 0;
    int row1Y = KB_Y + rowStep;
    for (int i = 0; i < 10; i++) {
        char c = shiftOn ? KB_ROW1[i] : (KB_ROW1[i] + 32);
        char label[2] = { c, 0 };
        drawKey(x, row1Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        x += KEY_W;
    }

    // Row 2: ASDFGHJKL + /
    x = 0;
    int row2Y = KB_Y + 2 * rowStep;
    for (int i = 0; i < 9; i++) {
        char c = shiftOn ? KB_ROW2[i] : (KB_ROW2[i] + 32);
        char label[2] = { c, 0 };
        drawKey(x, row2Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        x += KEY_W;
    }
    drawKey(x, row2Y, KEY_W, KEY_H, altOn ? "\\" : (shiftOn ? "?" : "/"), COL_KEY_FACE, COL_KEY_LABEL);

    // Row 3: ZXCVBNM + , .
    x = 0;
    int row3Y = KB_Y + 3 * rowStep;
    for (int i = 0; i < 7; i++) {
        char c = shiftOn ? KB_ROW3[i] : (KB_ROW3[i] + 32);
        char label[2] = { c, 0 };
        drawKey(x, row3Y, KEY_W, KEY_H, label, COL_KEY_FACE, COL_KEY_LABEL);
        x += KEY_W;
    }
    drawKey(x, row3Y, KEY_W, KEY_H, altOn ? "[" : (shiftOn ? "<" : ","), COL_KEY_FACE, COL_KEY_LABEL); x += KEY_W;
    drawKey(x, row3Y, KEY_W, KEY_H, altOn ? "]" : (shiftOn ? ">" : "."), COL_KEY_FACE, COL_KEY_LABEL);

    // Row 4: tall BS at bottom-left + [Shift] [Alt] [Space] [Hide]
    int row4Y = KB_Y + 4 * rowStep + 1;
    int bsY   = SCREEN_H - BS_H;
    uint16_t shiftFace = shiftOn ? TFT_NAVY : COL_BTN_BG;
    uint16_t altFace   = altOn   ? TFT_NAVY : COL_BTN_BG;
    drawKey(BS_X,    bsY,   BS_W,    BS_H,      "<-",    COL_BTN_BG, COL_BTN_TEXT);
    drawKey(SHIFT_X, row4Y, SHIFT_W, KEY_H - 1, shiftOn ? "SHF" : "shf", shiftFace, COL_BTN_TEXT);
    drawKey(ALT_X,   row4Y, ALT_W,   KEY_H - 1, altOn   ? "ALT" : "alt", altFace,   COL_BTN_TEXT);
    drawKey(SPACE_X, row4Y, SPACE_W, KEY_H - 1, "SPACE", COL_BTN_BG, COL_BTN_TEXT);
    drawKey(HIDE_X,  row4Y, HIDE_W,  KEY_H - 1, "Hide",  COL_BTN_BG, COL_BTN_TEXT);
}
#endif

// --- AP picker screen ---
#define AP_ROW_H  24   // height of each AP list row

// Convert RSSI to 4-char ASCII signal bar string.
static const char* rssiToBars(int rssi) {
    if (rssi >= -55) return "####";
    if (rssi >= -65) return "###.";
    if (rssi >= -75) return "##..";
    if (rssi >= -85) return "#...";
    return "....";
}

// WiFi signal colour for input bar icon (strong→green, good→orange, weak→yellow, none→red).
static uint16_t rssiColor() {
    if (WiFi.status() != WL_CONNECTED) return TFT_RED;
    int r = WiFi.RSSI();
    if (r >= -60) return TFT_GREEN;
    if (r >= -70) return TFT_ORANGE;
    if (r >= -80) return TFT_YELLOW;
    return TFT_RED;
}

// Draw a WiFi fan icon (dot + 3 arcs) into a sprite.
// cx/cy = centre of arcs (dot position, near bottom of icon).
// TFT_eSPI drawArc convention: 0°=bottom(6 o'clock), 90°=left, 180°=top, 270°=right.
// 135°→225° draws the upper fan (upper-left → top → upper-right) for a WiFi icon
// with the dot at the bottom.
static void drawWifiIcon(TFT_eSprite& spr, int cx, int cy, uint16_t color, uint16_t bg) {
    spr.fillCircle(cx, cy, 1, color);
    spr.drawArc(cx, cy,  4,  2, 135, 225, color, bg);
    spr.drawArc(cx, cy,  7,  5, 135, 225, color, bg);
    spr.drawArc(cx, cy, 10,  8, 135, 225, color, bg);
}

// Draw full-screen AP list. apCount entries from apSsids[]/apRssi[].
// Rows numbered 1–apCount starting at y=AP_ROW_H (row 0 = header).
void drawAPList(const char apSsids[][33], const int* apRssi, int apCount) {
#ifdef TARGET_EPAPER
    // Compact AP list for 200×200. Header row + up to 8 APs at 12 px each.
    tft.beginFrame();
    tft.epd.fillScreen(GxEPD_WHITE);
    tft.u8g2.setFont(EPD_FONT);
    tft.u8g2.setForegroundColor(GxEPD_BLACK);
    tft.u8g2.setBackgroundColor(GxEPD_WHITE);
    tft.u8g2.setCursor(2, 1 + EPD_FONT_ASCENT);
    tft.u8g2.print("Select WiFi network:");
    int maxAPs = min(apCount, (SCREEN_H - 12) / 12);  // header=12px, each AP=12px
    for (int i = 0; i < maxAPs; i++) {
        char line[64];
        snprintf(line, sizeof(line), "%d. %s  %s", i + 1, apSsids[i], rssiToBars(apRssi[i]));
        tft.u8g2.setCursor(2, 1 + (i + 1) * FONT_LINE_H + EPD_FONT_ASCENT);
        tft.u8g2.print(line);
    }
    tft.endFrame();
    return;
#endif
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    uint16_t fg = invertDisplay ? TFT_BLACK : TFT_WHITE;
    tft.fillScreen(bg);
    fontOff();
    uiFontOn();
    // Header row
    tft.setTextColor(fg, bg);
    tft.setCursor(2, (AP_ROW_H - TXT_H) / 2);
    tft.print("Select WiFi network:");
    // Entry rows
    for (int i = 0; i < apCount; i++) {
        int y = AP_ROW_H * (i + 1);
        tft.fillRect(0, y, SCREEN_W, AP_ROW_H - 1, COL_KEY_FACE);
        tft.setTextColor(COL_KEY_LABEL, COL_KEY_FACE);
        int ty = y + (AP_ROW_H - TXT_H) / 2;
        // Number
        char num[3]; snprintf(num, sizeof(num), "%d", i + 1);
        tft.setCursor(2, ty); tft.print(num);
        // SSID (truncated to fit before signal column)
        int sigX = SCREEN_W - 9 * TXT_W;
        int ssidMaxChars = (sigX - 2*TXT_W - 8) / TXT_W;
        if (ssidMaxChars > 22) ssidMaxChars = 22;
        char ssidDisp[23] = {0};
        strncpy(ssidDisp, apSsids[i], ssidMaxChars);
        tft.setCursor(2 + TXT_W, ty); tft.print(ssidDisp);
        // Signal bars + dBm (right side)
        char sig[12];
        snprintf(sig, sizeof(sig), "%s %4d", rssiToBars(apRssi[i]), apRssi[i]);
        tft.setCursor(sigX, ty); tft.print(sig);
    }
    uiFontOff();
}

// --- WiFi health ---
bool          wifiHealthy     = true;
unsigned long lastWiFiCheckMs = 0;

// --- Input buffer ---
char inputBuf[INPUT_BUF_SIZE] = {0};
int  inputLen      = 0;
int  inputCursor   = 0;   // insertion point within inputBuf; 0=before first char
bool moreMode      = false;  // true after AI reply → button shows "More"

