alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
void drawInputBar() {
#ifdef TARGET_C3
    // On C3 the input prompt is the last line of the chat area (no separate bar).
    // drawHistory() renders it as part of the history display; this function
    // redraws just that last slot when only the input text changes.
#ifdef TARGET_EPAPER
        {
            // Partial frame refresh: only the input row is updated (500 ms vs 1700 ms full).
            int lineH  = LINE_H_LARGE;
            int inputY = SCREEN_H - lineH;   // 106 on 122 px display — fixed at screen bottom
            tft.beginPartialFrame(0, inputY, SCREEN_W, lineH);
            tft.epd.fillRect(0, inputY, SCREEN_W, lineH, GxEPD_WHITE);
            tft.u8g2.setFont(EPD_FONT);
            tft.u8g2.setForegroundColor(GxEPD_BLACK);
            tft.u8g2.setBackgroundColor(GxEPD_WHITE);
            tft.u8g2.setCursor(2, inputY + EPD_FONT_ASCENT);
            tft.u8g2.print("> ");
            int32_t promptW = tft.textWidth("> ");
            int start = inputCursor;
            int availW = SCREEN_W - (int)promptW - 4;
            while (start > 0) {
                char tmp[INPUT_BUF_SIZE];
                int len = inputCursor - (start - 1);
                strncpy(tmp, inputBuf + start - 1, len);
                tmp[len] = '\0';
                if ((int)tft.textWidth(tmp) > availW - 2) break;
                start--;
            }
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            tft.u8g2.setCursor(2 + (int)promptW, inputY + EPD_FONT_ASCENT);
            tft.u8g2.print(dispBuf);
            // Cursor line
            char preCur[INPUT_BUF_SIZE] = {0};
            strncpy(preCur, inputBuf + start, inputCursor - start);
            int curX = 2 + (int)promptW + (int)tft.textWidth(preCur);
            tft.epd.drawLine(curX, inputY + 1, curX, inputY + lineH - 2, GxEPD_BLACK);
            tft.endFrame();
            return;
        }
#endif
    {
        int lineH  = LINE_H_LARGE;
        int inputY = (HIST_H_KB_HIDE / lineH - 1) * lineH;
        uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
        TFT_eSprite spr(&tft);
        spr.setColorDepth(16);
        if (spr.createSprite(SCREEN_W, lineH)) {
            FONT_LOAD(spr);
            spr.fillSprite(bg);
            spr.setTextColor(wifiHealthy ? TFT_DARKGREY : TFT_RED, bg);
            spr.drawString("> ", 2, 0);
            int promptW = spr.textWidth("> ");
            spr.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            const int iconW = 18;  // WiFi icon reserved width at right
            int availW = SCREEN_W - promptW - 4 - iconW;
            // Scroll so cursor is always visible
            int start = inputCursor;
            while (start > 0) {
                char tmp[INPUT_BUF_SIZE];
                int len = inputCursor - (start - 1);
                strncpy(tmp, inputBuf + start - 1, len);
                tmp[len] = '\0';
                if (spr.textWidth(tmp) > availW - 2) break;
                start--;
            }
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            spr.drawString(dispBuf, 2 + promptW, 0);
            // Cursor at inputCursor position
            char preCur[INPUT_BUF_SIZE] = {0};
            strncpy(preCur, inputBuf + start, inputCursor - start);
            int curX = 2 + promptW + spr.textWidth(preCur);
            spr.fillRect(curX, 2, 1, lineH - 4, invertDisplay ? TFT_DARKGREY : TFT_YELLOW);
            // WiFi signal icon at bottom right
            drawWifiIcon(spr, SCREEN_W - iconW / 2, lineH - 2, rssiColor(), bg);
            FONT_UNLOAD(spr);
            spr.pushSprite(0, inputY);
            spr.deleteSprite();
        } else {
            // Direct fallback
            tft.fillRect(0, inputY, SCREEN_W, SCREEN_H - inputY, bg);
            fontOn();
            tft.setTextColor(wifiHealthy ? TFT_DARKGREY : TFT_RED, bg);
            tft.drawString("> ", 2, inputY);
            int promptW = tft.textWidth("> ");
            tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
            int maxChars = (SCREEN_W - (int)promptW - 4 - 18) / TXT_W;  // 18px reserved for WiFi icon
            int start = (inputCursor > maxChars) ? inputCursor - maxChars : 0;
            char dispBuf[INPUT_BUF_SIZE] = {0};
            strncpy(dispBuf, inputBuf + start, inputLen - start);
            tft.drawString(dispBuf, 2 + promptW, inputY);
            tft.fillRect(2 + promptW + (inputCursor - start) * TXT_W, inputY, 2, TXT_H, invertDisplay ? TFT_BLACK : TFT_WHITE);
            fontOff();
        }
        return;
    }
#endif
    // CYD28: traditional input bar at bottom of screen
    int barY = kbVisible ? IBAR_Y_KB_SHOW : IBAR_Y_KB_HIDE;
    int barH = kbVisible ? IBAR_H_KB_SHOW : IBAR_H_KB_HIDE;

    tft.fillRect(0, barY, SCREEN_W, barH, COL_IBAR_BG);

    // Ensure smooth font is cleared — rebuildLines may leave it loaded on tft
    FONT_UNLOAD(tft);
    tft.setTextFont(1);

    // Prompt marker — red when WiFi health check fails
    tft.setTextColor(wifiHealthy ? COL_IBAR_TEXT : TFT_RED, COL_IBAR_BG);
    uiFontOn();
    tft.setCursor(2, barY + (barH - TXT_H) / 2);
    tft.print("> ");
    tft.setTextColor(COL_IBAR_TEXT, COL_IBAR_BG);
    int textStartX = tft.getCursorX();

    int maxChars = (SCREEN_W - BTN_SEND_W - textStartX - 4) / TXT_W;
    int start = (inputCursor > maxChars) ? inputCursor - maxChars : 0;
    char display[54] = {0};
    strncpy(display, inputBuf + start, maxChars);
    tft.print(display);
    // Cursor at inputCursor position (fixed-width font)
    tft.fillRect(textStartX + (inputCursor - start) * TXT_W, barY + (barH - TXT_H) / 2, 2, TXT_H, COL_IBAR_TEXT);

    // Button
    tft.fillRect(SCREEN_W - BTN_SEND_W, barY + BTN_INSET, BTN_SEND_W - BTN_INSET*2, barH - BTN_INSET*2, COL_BTN_BG);
    tft.setTextColor(wifiHealthy ? COL_BTN_TEXT : TFT_RED, COL_BTN_BG);
    const char* btnLbl = moreMode ? "More" : "Send";
    int bw = tft.textWidth(btnLbl);
    tft.drawString(btnLbl, SCREEN_W - BTN_SEND_W + (BTN_SEND_W - bw) / 2, barY + (barH - TXT_H) / 2);
    uiFontOff();

    if (!kbVisible) {
        tft.fillRect(SCREEN_W - BTN_SHOWKB_X, barY + BTN_INSET, BTN_SHOWKB_W, barH - BTN_INSET*2, COL_BTN_BG);
        tft.setTextColor(COL_BTN_TEXT, COL_BTN_BG);
        tft.setCursor(SCREEN_W - BTN_SHOWKB_X + 3, barY + (barH - 8) / 2);
        tft.print("Show KB");

        tft.fillRect(SCREEN_W - BTN_NEW_X, barY + BTN_INSET, BTN_NEW_W, barH - BTN_INSET*2, COL_BTN_BG);
        tft.setTextColor(COL_BTN_TEXT, COL_BTN_BG);
        tft.setCursor(SCREEN_W - BTN_NEW_X + 4, barY + (barH - 8) / 2);
        tft.print("New");
    }
}

// --- Conversation history (linked list) ---
// Each node allocates only strlen(text)+1 bytes for text, so short messages
// cost little heap and many more turns fit vs. a fixed 3KB-per-slot array.
struct HistoryNode {
    HistoryNode* next;
    bool  isUser;
    bool  isError;
    bool  displayOnly;  // true = show in chat but never sent to AI
    char  text[];       // flexible array — allocated as sizeof(HistoryNode)+len+1
};
// Budget: total text bytes to keep in heap. Leave ample room for TLS (~35KB) + BLE (~30KB).
#define HISTORY_TEXT_MAX    3071    // max text per message (unchanged)
#define HISTORY_HEAP_BUDGET 20000   // max total text bytes across all nodes

static HistoryNode* historyHead  = nullptr;
static HistoryNode* historyTail  = nullptr;
static int          historyCount = 0;
static int          historyBytes = 0;  // running sum of strlen(text) across all nodes

