alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
static HistoryNode* historyGet(int idx) {   // O(n) index; n is small
    HistoryNode* n = historyHead;
    for (int i = 0; i < idx && n; i++) n = n->next;
    return n;
}
static void historyEvict() {    // remove oldest single node
    if (!historyHead) return;
    HistoryNode* old = historyHead;
    historyHead = old->next;
    if (!historyHead) historyTail = nullptr;
    historyBytes -= (int)strlen(old->text);
    free(old);
    historyCount--;
}
static void historyClear() { while (historyHead) historyEvict(); }
int historyCount_get() { return historyCount; }  // extern-visible alias if needed

// Rendered line cache
#ifdef TARGET_C3
static const int  MAX_LINES  = 100;       // reduced from 250 to free heap for TLS+BLE coexistence
#else
static const int  MAX_LINES  = 250;
#endif
char              lines[MAX_LINES][128];  // 127 bytes + null per line (UTF-8 safe)
uint16_t          lineColor[MAX_LINES];
bool              lineIsUser[MAX_LINES];  // true = right-align (user message)
int               lineCount    = 0;
int               scrollOffset = 0;       // lines scrolled up from bottom

void rebuildLines() {
    lineCount = 0;
    for (HistoryNode* m = historyHead; m && lineCount < MAX_LINES - 2; m = m->next) {
        uint16_t col = m->isError ? COL_ERROR :
                       m->isUser  ? COL_USER  : COL_AI;
        bool isUser = m->isUser;
        const char* full = m->text;

        {
            // Pixel-width word wrap using smooth font (DejaVuSansBold12px)
            fontOn();
#ifdef TARGET_EPAPER
            // Use the same font for measurement as will be used for rendering,
            // so wrap points match display. Without this, a stale EPD_FONT_USER
            // makes AI text wrap too early (serif is narrower than bold sans-serif).
            tft.u8g2.setFont(isUser ? EPD_FONT_USER : EPD_FONT);
#endif
            char lineBuf[128] = "";
            const char* p = full;
            while (*p && lineCount < MAX_LINES - 1) {
                if (*p == '\n') {
                    if (lineBuf[0]) {
                        strncpy(lines[lineCount], lineBuf, 127);
                        lines[lineCount][127] = '\0';
                        lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
                        lineBuf[0] = '\0';
                    }
                    p++;
                    continue;
                }
                const char* ws = p;
                while (*p && *p != ' ' && *p != '\n') p++;
                int wlen = p - ws;
                if (wlen <= 0) { if (*p) p++; continue; }
                char word[128];
                strncpy(word, ws, min(wlen, 127));
                word[min(wlen, 127)] = '\0';
                if (*p == ' ') p++;
                char test[260];
                if (lineBuf[0]) snprintf(test, 260, "%s %s", lineBuf, word);
                else            { strncpy(test, word, 127); test[127] = '\0'; }
                if (tft.textWidth(test) <= SCREEN_W - 4) {
                    strncpy(lineBuf, test, 127); lineBuf[127] = '\0';
                } else {
                    if (lineBuf[0]) {
                        strncpy(lines[lineCount], lineBuf, 127);
                        lines[lineCount][127] = '\0';
                        lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
                        strncpy(lineBuf, word, 127); lineBuf[127] = '\0';
                    } else {
                        strncpy(lines[lineCount], word, 127);
                        lines[lineCount][127] = '\0';
                        lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
                    }
                }
            }
            if (lineBuf[0] && lineCount < MAX_LINES) {
                strncpy(lines[lineCount], lineBuf, 127);
                lines[lineCount][127] = '\0';
                lineColor[lineCount] = col; lineIsUser[lineCount++] = isUser;
            }
            fontOff();
        }
    }
}

void drawHistory() {
    int histH = kbVisible ? HIST_H_KB_SHOW : HIST_H_KB_HIDE;
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    int lineH  = LINE_H_LARGE;
    int maxVis = histH / lineH;

    // On C3: slot 0 = model heading, last slot = inline input prompt.
    int histSlots = maxVis;
#ifdef TARGET_C3
    histSlots = maxVis - 2;
#endif
#ifdef TARGET_EPAPER
    // No heading row. Input row fixed at screen bottom: inputY = SCREEN_H - lineH.
    // histSlots = number of chat rows that fit above the input row.
    const int inputY = SCREEN_H - lineH;   // bottom input row
    histSlots = inputY / lineH;             // chat rows above input
#endif
    int firstIdx = lineCount - histSlots - scrollOffset;
    if (firstIdx < 0) firstIdx = 0;

#ifdef TARGET_EPAPER
    // Rate-limit full refreshes to protect the panel.
    // Content-triggered refreshes (epdMsgPending) always go through regardless of interval.
    static unsigned long epdLastFullMs = 0;
    {
        unsigned long now = millis();
        if (!epdMsgPending && (now - epdLastFullMs < EPD_MIN_FULL_REFRESH_MS)) {
            drawInputBar();   // partial input-row update only
            return;
        }
        epdMsgPending = false;
        epdLastFullMs = now;
    }

    // Helper: render one history slot. Uses EPD_FONT_USER (italic) for user lines.
    // Also shows model name in slot 0 if it is empty and epdShowModel is set.
    auto renderSlot = [&](int slot, int fi, int displayCount) {
        int idx = fi + slot;
        if (idx < displayCount) {
            int y = 1 + slot * lineH;  // 1px top margin prevents tallest glyphs clipping at y=0
            if (lineIsUser[idx]) {
                tft.u8g2.setFont(EPD_FONT_USER);
                int32_t w = (int32_t)tft.u8g2.getUTF8Width(lines[idx]);
                tft.u8g2.setCursor(SCREEN_W - (int)w - 2, y + EPD_FONT_ASCENT);
            } else {
                tft.u8g2.setFont(EPD_FONT);
                tft.u8g2.setCursor(2, y + EPD_FONT_ASCENT);
            }
            tft.u8g2.print(lines[idx]);
        } else if (slot == 0 && epdShowModel) {
            const char* ml = useGrok ? "Grok 4.1 Fast" : useGroq ? "Groq OSS-120b" : GEMINI_MODEL;
            tft.u8g2.setFont(EPD_FONT);
            int32_t w = (int32_t)tft.u8g2.getUTF8Width(ml);
            tft.u8g2.setCursor(SCREEN_W - (int)w - 2, 1 + EPD_FONT_ASCENT);
            tft.u8g2.print(ml);
        }
    };

