alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
        int usedH = maxVis * lineH;
        if (usedH < histH)
            tft.fillRect(0, usedH, SCREEN_W, histH - usedH, bg);
        return;
    }
    // Sprite alloc failed — fall through to direct TFT drawing
#endif

    tft.fillRect(0, 0, SCREEN_W, histH, bg);

    fontOn();
    tft.setTextWrap(false);
    for (int i = 0; i < maxVis && (firstIdx + i) < lineCount; i++) {
        int idx = firstIdx + i;
        uint16_t col = lineColor[idx];
        if (invertDisplay && col != COL_ERROR) {
            col = lineIsUser[idx] ? COL_USER_LIGHT : TFT_BLACK;
        }
        tft.setTextColor(col, bg);
        if (lineIsUser[idx]) {
            tft.setTextDatum(TR_DATUM);
            tft.drawString(lines[idx], SCREEN_W, i * lineH);
            tft.setTextDatum(TL_DATUM);
        } else {
            tft.drawString(lines[idx], 2, i * lineH);
        }
    }
    tft.setTextWrap(true);
    fontOff();
}

// Returns true if codepoint cp is covered by the VLW font.
static bool supportedCodepoint(uint32_t cp) {
    if (cp >= 0x0020 && cp <= 0x007E) return true;  // Printable ASCII
    if (cp >= 0x00A0 && cp <= 0x017F) return true;  // Latin-1 + Latin Extended-A
    if (cp == 0x03A9 || cp == 0x03C0) return true;  // Ω π
    if (cp == 0x2011 || cp == 0x2013 || cp == 0x2014) return true;  // dashes
    if (cp == 0x2018 || cp == 0x2019 || cp == 0x201C || cp == 0x201D) return true;  // quotes
    if (cp == 0x2022 || cp == 0x2026) return true;  // bullet, ellipsis
    if (cp >= 0x2070 && cp <= 0x207F) return true;  // superscripts
    if (cp == 0x20AC) return true;  // €
    return false;
}

void addMessage(bool isUser, bool isError, const char* text, bool displayOnly = false) {
    const int TMAX = HISTORY_TEXT_MAX;

    // --- Sanitise into static buffer (never on stack; addMessage is not re-entrant) ---
    // Write pointer is always <= read pointer: multi-byte sequences only shrink or stay same size.
    static char sanBuf[TMAX + 1];
    {
        const char* s = text;
        char*       d = sanBuf;
        const char* end = sanBuf + TMAX;
        while (*s && d < end) {
            unsigned char c = (unsigned char)*s;
            if (c < 0x80) {
                if (c == '\n' || (c >= 0x20 && c != 0x7F)) *d++ = (char)c;
                s++;
            } else if ((c & 0xE0) == 0xC0) {
                unsigned char b2 = (unsigned char)s[1];
                if ((b2 & 0xC0) == 0x80) {
                    uint32_t cp = ((c & 0x1F) << 6) | (b2 & 0x3F);
                    if (cp == 0x00AD) { /* soft hyphen: drop */ }
                    else if (supportedCodepoint(cp)) { *d++ = (char)c; *d++ = (char)b2; }
                    else *d++ = '?';
                    s += 2;
                } else { *d++ = '?'; s++; }
            } else if ((c & 0xF0) == 0xE0) {
                unsigned char b2 = (unsigned char)s[1];
                unsigned char b3 = (unsigned char)s[2];
                if ((b2 & 0xC0) == 0x80 && (b3 & 0xC0) == 0x80) {
                    uint32_t cp = ((c & 0x0F) << 12) | ((b2 & 0x3F) << 6) | (b3 & 0x3F);
                    if ((cp >= 0x2000 && cp <= 0x200A) || cp == 0x202F || cp == 0x205F)
                        *d++ = ' ';
                    else if (cp == 0x2010 || cp == 0x2012 || cp == 0x2015 || cp == 0x2212)
                        *d++ = '-';
                    else if (cp == 0x200B || cp == 0x200C || cp == 0x200D ||
                             cp == 0x2060 || cp == 0xFEFF) { /* drop */ }
                    else if (supportedCodepoint(cp)) {
                        *d++ = (char)c; *d++ = (char)b2; *d++ = (char)b3;
                    } else *d++ = '?';
                    s += 3;
                } else { *d++ = '?'; s++; }
            } else if ((c & 0xF8) == 0xF0) {
                *d++ = '?'; s += 4;
            } else {
                s++;
            }
        }
        *d = '\0';
    }
    int len = (int)strlen(sanBuf);

    // --- Evict oldest pairs before allocating so freed memory is immediately reusable ---
    while (historyCount >= 2 && historyBytes + len > HISTORY_HEAP_BUDGET) {
        historyEvict();
        historyEvict();
    }

    // --- Allocate exactly the right size — no realloc needed ---
    HistoryNode* node = (HistoryNode*)malloc(sizeof(HistoryNode) + len + 1);
    if (!node) return;
    node->next        = nullptr;
    node->isUser      = isUser;
    node->isError     = isError;
    node->displayOnly = displayOnly;
    memcpy(node->text, sanBuf, len + 1);

    // --- Append to tail ---
    if (historyTail) historyTail->next = node;
    else             historyHead = node;
    historyTail = node;
    historyBytes += len;
    historyCount++;
    scrollOffset = 0;   // auto-scroll to bottom
#ifdef TARGET_EPAPER
    int prevLineCount = lineCount;
#endif
    rebuildLines();
#ifdef TARGET_EPAPER
    // If the line cache is nearly full, evict oldest pairs until there is slack for
    // future messages (AI responses can be up to ~14 lines on the 200×200 display).
    // Rebuild once after eviction so the display reflects the trimmed history.
    while (lineCount > MAX_LINES - 20 && historyCount >= 2) {
        historyEvict();
        historyEvict();
        rebuildLines();   // recount lines after each pair so loop exits as soon as there is room
    }
    epdMsgPending = true;   // bypass rate limit — new content must always render
    if (!isUser) {
        epdShowModel = false;   // discard model name once AI responds
    } else if (!isError && lineCount - prevLineCount == 1) {
        // Single-line user prompt: show at input row without scrolling
        epdPromptInInputRow = true;
        strncpy(epdPromptBuf, lines[lineCount - 1], 127);
        epdPromptBuf[127] = '\0';
    }
#endif
    drawHistory();
}

// Show keyboard and let user type a password. Returns typed string in out (64 bytes).
// Uses the existing keyboard (inputBuf/inputLen/shiftOn/altOn globals).
// Tap the Send button area (input bar) to submit.
void enterPassword(const char* ssidPrompt, char* out) {
    inputBuf[0] = '\0';
    inputLen    = 0;
    inputCursor = 0;
    moreMode    = false;
    shiftOn     = false;
    altOn       = false;
#ifndef TARGET_C3
    kbVisible   = true;
#endif

