alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
#ifdef TARGET_C3
    {
#ifdef TARGET_EPAPER
        {
            tft.beginFrame();
            tft.epd.fillScreen(GxEPD_WHITE);
            tft.u8g2.setFont(EPD_FONT);
            tft.u8g2.setForegroundColor(GxEPD_BLACK);
            tft.u8g2.setBackgroundColor(GxEPD_WHITE);
            tft.u8g2.setCursor(2, 1 + EPD_FONT_ASCENT);
            tft.u8g2.print("Password for:");
            tft.u8g2.setCursor(2, 1 + FONT_LINE_H + EPD_FONT_ASCENT);
            tft.u8g2.print(ssidPrompt);
            tft.endFrame();
        }
#else
        // Use sprite rendering for all rows — fillRect is unreliable on C3 for large areas
        // (per-glyph setWindow/pushBlock SPI glitches leave stale pixels from the AP scan).
        // Reuse one line-height sprite: draw header lines, then fill blank rows to the bottom.
        int lineH = LINE_H_LARGE;
        int inputY = (HIST_H_KB_HIDE / lineH - 1) * lineH;  // y of input bar (matches drawInputBar)
        uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
        uint16_t fg = invertDisplay ? TFT_BLACK : TFT_WHITE;
        TFT_eSprite spr(&tft);
        spr.setColorDepth(16);
        if (spr.createSprite(SCREEN_W, lineH)) {
            FONT_LOAD(spr);
            // Line 0: "Password for:"
            spr.fillSprite(bg);
            spr.setTextColor(TFT_YELLOW, bg);
            spr.drawString("Password for:", 2, 0);
            spr.pushSprite(0, 0);
            // Line 1: SSID
            spr.fillSprite(bg);
            spr.setTextColor(fg, bg);
            spr.drawString(ssidPrompt, 2, 0);
            spr.pushSprite(0, lineH);
            FONT_UNLOAD(spr);
            // Blank rows from line 2 down to just above the input bar
            spr.fillSprite(bg);
            for (int y = 2 * lineH; y < inputY; y += lineH)
                spr.pushSprite(0, y);
            spr.deleteSprite();
        }
#endif
    }
#else
    {
        uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
        tft.fillRect(0, 0, SCREEN_W, SCREEN_H, bg);
        fontOff();
        uiFontOn();
        tft.setTextColor(TFT_YELLOW, bg);
        tft.drawString("Password for:", 2, 0);
        tft.setTextColor(invertDisplay ? TFT_BLACK : TFT_WHITE, bg);
        tft.drawString(ssidPrompt, 2, TXT_H);
        uiFontOff();
    }
    drawKeyboard();
#endif
    drawInputBar();

    while (true) {
        InputEvent ev;
        if (!halPollInput(&ev)) { delay(10); continue; }

        switch (ev.type) {
            case INPUT_ENTER:
                strncpy(out, inputBuf, 63); out[63] = '\0';
                inputBuf[0] = '\0'; inputLen = 0; inputCursor = 0;   // clear sensitive data
                return;
            case INPUT_CHAR:
                if (inputLen < 63) {
                    memmove(inputBuf + inputCursor + 1, inputBuf + inputCursor, inputLen - inputCursor + 1);
                    inputBuf[inputCursor] = ev.ch;
                    inputLen++; inputCursor++;
#ifdef TARGET_EPAPER
                    // Drain any queued chars before the 500ms partial refresh —
                    // avoids one refresh per keystroke when typing faster than the display.
                    { InputEvent nx;
                      while (inputLen < 63 && halPeekInput(&nx) && nx.type == INPUT_CHAR) {
                          halPollInput(&nx);
                          memmove(inputBuf + inputCursor + 1, inputBuf + inputCursor, inputLen - inputCursor + 1);
                          inputBuf[inputCursor] = nx.ch;
                          inputLen++; inputCursor++;
                      } }
#endif
                    drawInputBar();
                }
                break;
            case INPUT_BACKSPACE:
                if (inputCursor > 0) {
                    memmove(inputBuf + inputCursor - 1, inputBuf + inputCursor, inputLen - inputCursor + 1);
                    inputLen--; inputCursor--;
                    drawInputBar();
                }
                break;
            case INPUT_CURSOR_LEFT:
                if (inputCursor > 0) { inputCursor--; drawInputBar(); }
                break;
            case INPUT_CURSOR_RIGHT:
                if (inputCursor < inputLen) { inputCursor++; drawInputBar(); }
                break;
            default:
                break;
        }
    }
}

void sendPrompt();  // forward declaration — defined after callGemini()

// Set LED colour based on WiFi RSSI (called after every health check)
// Blue ≥-55  Cyan ≥-65  Green ≥-75  Orange=weak-but-connected  Red=lost
void updateLedWifi() {
    if (WiFi.status() != WL_CONNECTED) {
        halSetLed(255, 0, 0);   // Red: WiFi lost
        return;
    }
    int rssi = WiFi.RSSI();
    if      (rssi >= RSSI_THRESH_BLUE)  halSetLed(  0,   0, 255);  // Blue:   strongest
    else if (rssi >= RSSI_THRESH_CYAN)  halSetLed(  0, 255, 255);  // Cyan:   good
    else if (rssi >= RSSI_THRESH_GREEN) halSetLed(  0, 255,   0);  // Green:  fair
    else                  halSetLed(255, 128,   0);  // Orange: weak
}

// --- WiFi ---
// Returns true if connected. Pass showSplash=true for boot (draws title + "Connecting:" text).
bool connectWiFi(const char* ssid, const char* pass, bool showSplash = false) {
    if (showSplash) {
#ifdef TARGET_EPAPER
        char wifiMsg[64];
        snprintf(wifiMsg, sizeof(wifiMsg), "WiFi: %.44s", ssid);
        tft.beginFrame();
        tft.epd.fillScreen(GxEPD_WHITE);
        tft.u8g2.setFont(EPD_FONT);
        tft.u8g2.setForegroundColor(GxEPD_BLACK);
        tft.u8g2.setBackgroundColor(GxEPD_WHITE);
        tft.u8g2.setCursor(2, 1 + EPD_FONT_ASCENT);
        tft.u8g2.print(wifiMsg);
        tft.endFrame();
#else
        fontOn();
        tft.setTextColor(TFT_NAVY, TFT_WHITE);
        char wifiMsg[80];
        snprintf(wifiMsg, sizeof(wifiMsg), "Connecting: %.55s...", ssid);
        tft.drawString(wifiMsg, 2, 0);
        fontOff();
#endif
    }
    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, pass);
    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < WIFI_MAX_ATTEMPTS) {
        delay(WIFI_RETRY_DELAY_MS);
        attempts++;
    }
#ifndef TARGET_EPAPER
    if (showSplash) tft.fillRect(0, 0, SCREEN_W, LINE_H_LARGE + 2, TFT_WHITE);
#endif
    // MAX_MODEM: WiFi wakes only at DTIM beacons — lowest idle current while staying associated.
    // WIFI_PS_NONE is restored by halBeforeApiCall() during TLS connections.
    esp_wifi_set_ps(WIFI_PS_MAX_MODEM);
    updateLedWifi();
    return WiFi.status() == WL_CONNECTED;
}

