alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
// --- Gemini API call ---
String callGemini(const char* prompt) {
    // Build URL path early (stack-only, no heap)
    char path[256];
    snprintf(path, sizeof(path),
        "/v1beta/models/%s:generateContent?key=%s",
        GEMINI_MODEL, GEMINI_API_KEY);

    // Reconnect WiFi if dropped
    if (WiFi.status() != WL_CONNECTED) {
        connectWiFi(wifiSsid[0], wifiPass[0]);
        connectWiFi(wifiSsid[0], wifiPass[0]);
        if (WiFi.status() != WL_CONNECTED) return "ERR: WiFi not connected";
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(API_TIMEOUT_MS / 1000);

    showWaiting("Thinking...");
    if (!client.connect(GEMINI_HOST, HTTPS_PORT)) {
        return "ERR: connect failed (check WiFi/DNS)";
    }

    // Build + send request. reqDoc copies history text (~15KB) and serializeJson
    // needs AES record buffers (~16KB) — keep fullResp out of scope here to avoid
    // three-way heap pressure (reqDoc + AES + fullResp reservation).
    {
        JsonDocument reqDoc;
        JsonObject sysInstr = reqDoc["system_instruction"].to<JsonObject>();
        JsonArray  sysParts = sysInstr["parts"].to<JsonArray>();
        JsonObject sysPart  = sysParts.add<JsonObject>();
        sysPart["text"]     = AI_SYSTEM_PROMPT AI_WEB_SEARCH_SUFFIX;

        JsonArray contents = reqDoc["contents"].to<JsonArray>();
        bool gcSeenUser = false;
        for (HistoryNode* n = historyHead; n && n != historyTail; n = n->next) {
            if (n->displayOnly) continue;
            if (!gcSeenUser && !n->isUser) continue;  // skip orphaned AI turns at head
            gcSeenUser = true;
            JsonObject msg  = contents.add<JsonObject>();
            msg["role"]     = n->isUser ? "user" : "model";
            JsonArray parts = msg["parts"].to<JsonArray>();
            JsonObject part = parts.add<JsonObject>();
            part["text"]    = n->text;
        }
        JsonObject curMsg  = contents.add<JsonObject>();
        curMsg["role"]     = "user";
        JsonArray curParts = curMsg["parts"].to<JsonArray>();
        JsonObject curPart = curParts.add<JsonObject>();
        curPart["text"]    = prompt;
        JsonArray tools = reqDoc["tools"].to<JsonArray>();
        tools.add<JsonObject>()["google_search"].to<JsonObject>();

        // measureJson → Content-Length header; PrintBuffer → chunked TLS writes.
        int bodyLen = measureJson(reqDoc);
        client.printf(
            "POST %s HTTP/1.0\r\n"
            "Host: " GEMINI_HOST "\r\n"
            "Content-Type: application/json\r\n"
            "Content-Length: %d\r\n\r\n",
            path, bodyLen);
        { PrintBuffer pb(client); serializeJson(reqDoc, pb); pb.flush(); }
        // reqDoc freed here — scope ends
    }

    // Abort immediately if the write failed — avoids spinning in the read loop for 15s
    // on a dead socket, which starves BLE and can trigger a watchdog reset.
    if (!client.connected()) {
        client.stop();
        Serial.println("[Gemini] write failed");
        return "ERR: write failed";
    }

    // Reserve response buffer AFTER reqDoc is freed — avoids three-way heap pressure
    // (TLS + reqDoc + fullResp). String::concat into a pre-reserved buffer never reallocs,
    // preventing the null-pointer write (Store fault) seen under heap pressure.
    String fullResp;
    // TLS holds ~52KB heap, leaving ~20KB free. Use largest available contiguous block
    // (capped at 8KB — enough for a 120-word Gemini reply including headers).
    // String::concat into a pre-reserved buffer never reallocs → no null-pointer crash.
    size_t avail = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
    const size_t RESP_CAP = (avail > 9216) ? 8192 : (avail > 5120 ? avail - 1024 : 0);
    if (RESP_CAP == 0 || !fullResp.reserve(RESP_CAP)) {
        Serial.printf("[Gemini] low heap (%d / largest=%d), cannot reserve response buffer\n",
                      ESP.getFreeHeap(), (int)avail);
        client.stop();
        return "ERR: low memory";
    }
    Serial.printf("[Gemini] resp cap=%d (free=%d)\n", (int)RESP_CAP, ESP.getFreeHeap());

    uint8_t rbuf[256];
    unsigned long deadline   = millis() + API_TIMEOUT_MS;
    unsigned long nextMsgMs  = millis() + API_WAIT_FIRST_MS;
    unsigned long lastData   = millis();
    bool receivedAny = false;
    while (millis() < deadline) {
        int n = client.read(rbuf, sizeof(rbuf));
        if (n > 0) {
            lastData = millis();
            receivedAny = true;
            if (fullResp.length() < RESP_CAP)
                fullResp.concat((const char*)rbuf, n);
            continue;  // read more without delay
        }
        // n <= 0: no data right now. Never break on this alone.
        if (!client.connected()) break;                          // connection closed (any state)
        if (receivedAny && millis() - lastData > 1000) break;   // 1s idle = response complete
        if (!receivedAny && millis() - lastData > 15000) break; // 15s no first byte = give up
        if (WiFi.status() != WL_CONNECTED) break;
        if (millis() >= nextMsgMs) {
            showWaiting(WAIT_MSGS[waitMsgIdx]);
            waitMsgIdx = (waitMsgIdx + 1) % NUM_WAIT_MSGS;
            nextMsgMs += 4000;
        }
#ifndef TARGET_C3
        pollKBHide();
#endif
        delay(5);
    }
    client.stop();
    Serial.printf("[Gemini] response len=%d\n", fullResp.length());

    if (fullResp.length() == 0) return "ERR: empty response";

    // Extract HTTP status code
    int httpStatus = 200;
    int statusPos = fullResp.indexOf("HTTP/");
    if (statusPos >= 0) {
        int eol = fullResp.indexOf('\n', statusPos);
        sscanf(fullResp.substring(statusPos, eol).c_str(), "HTTP/%*s %d", &httpStatus);
    }

    int hdrEnd = fullResp.indexOf("\r\n\r\n");
    int bodyOff = (hdrEnd >= 0) ? hdrEnd + 4 : 0;

    // Detect truncated response via Content-Length.
    if (hdrEnd > 0) {
        int clPos = fullResp.indexOf("Content-Length: ");
        if (clPos > 0 && clPos < hdrEnd) {
            int contentLen = atoi(fullResp.c_str() + clPos + 16);
            int bodyGot    = (int)fullResp.length() - bodyOff;
            if (bodyGot < contentLen) {
                Serial.printf("[Gemini] truncated: %d of %d body bytes\n", bodyGot, contentLen);
                return "ERR: truncated response";
            }
        }
    }

    // Decode chunked transfer encoding. The server may respond HTTP/1.1 chunked even
    // when we request HTTP/1.0 — chunk-size lines embedded in the JSON cause ArduinoJson
    // to return InvalidInput. extractBody() removes them. Free fullResp immediately after
    // to avoid holding both the raw and decoded buffers simultaneously.
    String body = extractBody(fullResp);
    fullResp = String();  // release raw response buffer (~10KB) before JSON parsing

    int jsonStart = body.indexOf('{');
    if (jsonStart < 0) {
        char buf[40]; snprintf(buf, sizeof(buf), "ERR: HTTP %d, no JSON", httpStatus);
        return String(buf);
    }

    // Parse JSON — use filter to skip grounding metadata (can be 8KB+)
    JsonDocument filter;
    filter["candidates"][0]["content"]["parts"][0]["text"] = true;
    filter["error"]["message"] = true;
    JsonDocument respDoc;
    DeserializationError derr = deserializeJson(respDoc, body.c_str() + jsonStart,
                                                DeserializationOption::Filter(filter));
    if (derr == DeserializationError::Ok || derr == DeserializationError::IncompleteInput) {
        // IncompleteInput is normal: Gemini appends large metadata after the text field;
        // SSL close_notify arrives before all of it. Text is captured before truncation.
        const char* errMsg = respDoc["error"]["message"];
        if (errMsg) {
            char buf[80]; snprintf(buf, sizeof(buf), "ERR: %.72s", errMsg);
            return String(buf);
        }

        const char* text = respDoc["candidates"][0]["content"]["parts"][0]["text"];
        if (text) return String(text);
    }

    // JSON parse failed or text field not captured — manually extract "text": "..."
    Serial.printf("[Gemini] JSON err=%s, trying manual extract\n", derr.c_str());
    const char* raw = body.c_str() + jsonStart;
    const char* marker = strstr(raw, "\"text\": \"");
    if (!marker) marker = strstr(raw, "\"text\":\"");
    if (marker) {
        const char* start = strchr(marker + 6, '"') + 1;  // skip past opening quote
        String result;
        const char* p = start;
        bool closed = false;
        while (*p) {
            if (*p == '\\' && *(p+1)) { result += *p++; result += *p++; continue; }
            if (*p == '"') { closed = true; break; }
            result += *p++;
        }
        if (!closed) {
            // SSL died mid-string — text field was never closed; retry rather than show garbage
            Serial.printf("[Gemini] manual extract truncated (%d chars, no closing quote)\n", result.length());
            return "ERR: truncated response";
        }
        result.replace("\\n", "\n");
        result.replace("\\\"", "\"");
        result.replace("\\\\", "\\");
        if (result.length() > 0) {
            Serial.printf("[Gemini] manual extract OK (%d chars)\n", result.length());
            return result;
        }
    }

