alunmorris/ESP32-AI-chatbot-terminals/src/main.cpp
#ifdef TARGET_C3
// Draw one line of text as a sprite to avoid C3 per-glyph SPI glitches.
static void c3Line(int y, const char* text, uint16_t col, uint16_t bg) {
    int lineH = LINE_H_LARGE; // sprite height always 15 — font yAdvance needs full height to render
    TFT_eSprite spr(&tft);
    spr.setColorDepth(16);
    if (spr.createSprite(SCREEN_W, lineH)) {
        FONT_LOAD(spr);
        spr.fillSprite(bg);
        spr.setTextColor(col, bg);
        spr.drawString(text, 2, 0);
        FONT_UNLOAD(spr);
        spr.pushSprite(0, y);
        spr.deleteSprite();
    }
}
#endif

#ifdef TARGET_EPAPER
// --- Session persistence (NVS/Preferences) ---
// Namespaces: "session" (model/flags/count) and "sess_h" (per-message text+flags).
// NVS partition is 20KB shared with wifi creds. Budget 12KB for message text;
// pack as many recent messages as fit rather than a fixed count.
#define SESSION_TEXT_BUDGET 16000  // bytes of raw message text; leaves ~4KB for NVS overhead + wifi

static void saveSession() {
    // Collect pointers newest-first until SESSION_TEXT_BUDGET is reached.
    // HistoryNode is a singly-linked forward list, so gather into a temp array.
    const HistoryNode* ptrs[256];
    int saveCount = 0;
    int totalBytes = 0;
    // First pass: collect all nodes in order
    int total = historyCount;
    if (total > 255) total = 255;
    const HistoryNode* tmp[256];
    int tc = 0;
    for (const HistoryNode* n = historyHead; n && tc < 256; n = n->next)
        tmp[tc++] = n;
    // Walk backwards selecting nodes within budget
    for (int i = tc - 1; i >= 0; i--) {
        int len = (int)strlen(tmp[i]->text);
        if (totalBytes + len > SESSION_TEXT_BUDGET) break;
        totalBytes += len;
        ptrs[saveCount++] = tmp[i];
    }
    // Reverse ptrs[] so they are chronological (oldest first)
    for (int i = 0, j = saveCount - 1; i < j; i++, j--) {
        const HistoryNode* t = ptrs[i]; ptrs[i] = ptrs[j]; ptrs[j] = t;
    }

    Preferences meta;
    meta.begin("session", false);
    meta.putString("model",  GEMINI_MODEL);
    meta.putBool("global",   geminiUseGlobal);
    meta.putBool("grok",     useGrok);
    meta.putBool("groq",     useGroq);
    meta.putUChar("count",   (uint8_t)saveCount);
    meta.end();

    Preferences hist;
    hist.begin("sess_h", false);
    hist.clear();
    for (int i = 0; i < saveCount; i++) {
        char tk[4], fk[4];
        snprintf(tk, sizeof(tk), "t%d", i);
        snprintf(fk, sizeof(fk), "f%d", i);
        hist.putString(tk, ptrs[i]->text);
        uint8_t fl = (ptrs[i]->isUser      ? 1 : 0)
                   | (ptrs[i]->isError     ? 2 : 0)
                   | (ptrs[i]->displayOnly ? 4 : 0);
        hist.putUChar(fk, fl);
    }
    hist.end();
}

static bool loadSession() {
    Preferences meta;
    meta.begin("session", true);
    if (!meta.isKey("count")) { meta.end(); return false; }
    strlcpy(GEMINI_MODEL, meta.getString("model", "").c_str(), sizeof(GEMINI_MODEL));
    geminiUseGlobal = meta.getBool("global", false);
    useGrok         = meta.getBool("grok",   false);
    useGroq         = meta.getBool("groq",   false);
    int count       = (int)meta.getUChar("count", 0);
    meta.end();
    if (count == 0) return false;

    Preferences hist;
    hist.begin("sess_h", true);
    historyClear();
    for (int i = 0; i < count; i++) {
        char tk[4], fk[4];
        snprintf(tk, sizeof(tk), "t%d", i);
        snprintf(fk, sizeof(fk), "f%d", i);
        String text = hist.getString(tk, "");
        if (text.isEmpty()) break;
        uint8_t fl  = hist.getUChar(fk, 0);
        bool isUser = (fl & 1) != 0;
        bool isErr  = (fl & 2) != 0;
        bool dispOnly = (fl & 4) != 0;
        addMessage(isUser, isErr, text.c_str(), dispOnly);
    }
    hist.end();
    rebuildLines();
    return historyCount > 0;
}
#endif // TARGET_EPAPER

// Single source of truth for AI model options.
// Add or rename entries here — menu display and key handling both derive from this table.
struct ModelDef {
    char        key;     // keypress shown in menu
    const char* name;    // human-readable display name
    const char* apiId;   // Gemini model ID; nullptr for non-Gemini backends
    bool        global;  // geminiUseGlobal flag (Gemini only)
    bool        isGrok;  // route to Grok (xAI)
    bool        isGroq;  // route to Groq
    bool        p3;      // show on P3 (284×76, space-limited)
};
static const ModelDef MODEL_DEFS[] = {
    {'1', "Gemini 3.1 Flash Lite", "gemini-3.1-flash-lite-preview", true,  false, false, true },
    {'2', "Gemini 3 Flash",        "gemini-3-flash-preview",        true,  false, false, false},
    {'3', "Gemini 3.1 Pro",        "gemini-3.1-pro-preview",        false, false, false, false},
    {'4', "Grok 4.1 Fast",         nullptr,                         false, true,  false, true },
    {'5', "Groq OSS-120b",         nullptr,                         false, false, true,  false},
};
static const int NUM_MODELS = (int)(sizeof(MODEL_DEFS) / sizeof(MODEL_DEFS[0]));

void showModelChoices(bool sessionAvail = false) {
    char buf[40];  // longest entry: "5 Gemini 3.1 Flash Lite" = well under 40
    uint16_t bg = invertDisplay ? COL_INVERT_BG : COL_BG;
    uint16_t fg = invertDisplay ? TFT_BLACK : TFT_WHITE;
#ifdef TARGET_P3
    int optY = 2 * LINE_H_P3;
    for (int i = 0; i < NUM_MODELS; i++) {
        if (!MODEL_DEFS[i].p3) continue;
        snprintf(buf, sizeof(buf), "%c %s", MODEL_DEFS[i].key, MODEL_DEFS[i].name);
        c3Line(optY, buf, fg, bg); optY += LINE_H_P3;
    }
    if (invertDisplay) c3Line(optY, "D Dark Theme", fg, bg);
#elif defined(TARGET_EPAPER)
    tft.beginFrame();
    tft.epd.fillScreen(GxEPD_WHITE);
    tft.u8g2.setFont(EPD_FONT);
    tft.u8g2.setForegroundColor(GxEPD_BLACK);
    tft.u8g2.setBackgroundColor(GxEPD_WHITE);
    tft.u8g2.setCursor(2, 1 + EPD_FONT_ASCENT);
    tft.u8g2.print("Paper AI Remote Terminal");
    tft.u8g2.setCursor(2, 1 + 2 * LINE_H_LARGE + EPD_FONT_ASCENT);
    tft.u8g2.print("Select AI model:");
    {
        int optY = 3 * LINE_H_LARGE;
        for (int i = 0; i < NUM_MODELS; i++) {
            snprintf(buf, sizeof(buf), "%c %s", MODEL_DEFS[i].key, MODEL_DEFS[i].name);
            tft.u8g2.setCursor(2, 1 + optY + EPD_FONT_ASCENT);
            tft.u8g2.print(buf);
            optY += LINE_H_LARGE;
        }
        if (sessionAvail) {
            tft.u8g2.setCursor(2, 1 + optY + EPD_FONT_ASCENT);
            tft.u8g2.print("R Resume last session");
        }
    }
    tft.endFrame();
#elif defined(TARGET_C3)
    int optY = 2 * LINE_H_LARGE;
    for (int i = 0; i < NUM_MODELS; i++) {
        snprintf(buf, sizeof(buf), "%c %s", MODEL_DEFS[i].key, MODEL_DEFS[i].name);
        c3Line(optY, buf, fg, bg); optY += LINE_H_LARGE;
    }
    if (invertDisplay) c3Line(optY, "D Dark Theme", fg, bg);
#else
    uiFontOn();
    tft.setTextColor(fg, bg);
    int optY = 2 * TXT_H + 4;
    for (int i = 0; i < NUM_MODELS; i++) {
        snprintf(buf, sizeof(buf), "%c %s", MODEL_DEFS[i].key, MODEL_DEFS[i].name);
        tft.drawString(buf, 2, optY); optY += TXT_H;
    }
    if (invertDisplay) tft.drawString("D Dark Theme", 2, optY);
    uiFontOff();
#endif
}

